{
    "html_css": {
        "name": "HTML и CSS",
        "level0": "Знаю основы HTML-тегов и атрибутов, оснвоные свйоства CSS, понимаю семантичсекую разметку.",
        "level1": "Владею продвинутыми техниками CSS, умею создавать сложные стили, адаптивные элементы.",
        "level2": "Создаю адаптивные и кроссбраузерные дизайны, применяю media queries, работаю с CSS-анимацией, использую методологии (BEM, SMACSS).",
        "level3": "Применяю фреймворки и препроцессоры, работаю с Bootstrap, Tailwind, использую SCSS/LESS, автоматизирую процесс сборки стилей."
    },
    "javascript": {
        "name": "JavaScript",
        "level0": "Знаю основы JavaScript, переменные, циклы, массивы, функции, DOM-манипуляции.",
        "level1": "Работаю с асинхронностью и событиями, использую Promise, async/await, работаю с fetch API, обрабатываю события.",
        "level2": "Применяю современные технологии, использую ES6+, работаю с модулями, знаю про Web Components, использую localStorage и sessionStorage.",
        "level3": "Разрабатываю сложные веб-приложения, работаю с React/Vue/Angular, использую state-менеджеры (Redux, Vuex, Pinia), оптимизирую производительность кода."
    },
    "php": {
        "name": "PHP",
        "level0": "Знаю основы PHP, работаю с переменными, операторами, циклами, функциями, массивами.",
        "level1": "Создаю серверные скрипты, обрабатываю формы, работаю с сессиями и куки, подключаюсь к базам данных.",
        "level2": "Работаю с фреймворками и ООП, использую Laravel/Symfony, применяю паттерны проектирования.",
        "level3": "Разрабатываю масштабируемые серверные приложения, оптимизирую код, проектирую архитектуру API, работаю с микросервисами, интегрирую кеширование."
    },
    "data_bases": {
        "name": "Базы данных",
        "level0": "Знаю основы SQL, умею писать простые запросы.",
        "level1": "Работаю с реляционными БД, использую индексы, связи, подзапросы, работаю с транзакциями.",
        "level2": "Оптимизирую работу БД, использую нормализацию, понимаю различия InnoDB и MyISAM, умею анализировать.",
        "level3": "Проектирую сложные структуры данных, работаю с NoSQL, оптимизирую производительность базы, проектирую кластерные решения."
    },
    "bitrix": {
        "name": "1C-Bitrix",
        "level0": "Работаю с готовыми модулями, умею устанавливать и настраивать Битрикс, редактировать шаблоны, работать с административной панелью.",
        "level1": "Создаю кастомные решения, пишу свои компоненты, подключаю API, работаю с ORM Битрикс.",
        "level2": "Оптимизирую производительность, использую highload-блоки, настраиваю кеширование, анализирую нагрузку.",
        "level3": "Проектирую сложные проекты, разрабатываю масштабируемые решения, интегрирую Битрикс с внешними сервисами."
    },
    "linux": {
        "name": "Unix/Linux",
        "level0": "Знаю базовые команды, навигация по файловой системе, копирование, перемещение, изменение прав.",
        "level1": "Администрирую серверы, работаю с пользователями и группами, управляю процессами.",
        "level2": "Настраиваю веб-серверы, конфигурирую Apache/Nginx, работаю с SSL, оптимизирую производительность сервера.",
        "level3": "Проектирую отказоустойчивые системы, управляю кластерными решениями, использую балансировщики нагрузки."
    },
    "git": {
        "name": "Git",
        "level0": "Использую базовые команды.",
        "level1": "Работаю с ветками.",
        "level2": "Настраиваю командную работу.",
        "level3": "Оптимизирую процессы, разрабатываю стратегии ветвления, автоматизирую деплой и тестирование."
    },
    "teamwork": {
        "name": "Командность",
        "level0": "Знаком с основами проектного управления, понимаю Agile, Scrum, Kanban, умею работать с задачами.",
        "level1": "Организую рабочий процесс, веду задачи в Jira/Trello, участвую в code review, использую CI/CD.",
        "level2": "Руковожу командой, провожу ретроспективы, организую митинги, слежу за метриками эффективности.",
        "level3": "Разрабатываю стратегии развития, планирую архитектуру проекта, распределяю ресурсы, внедряю новые технологии."
    },
    "initiative": {
        "name": "Инициативность",
        "level0": "Делаю, что скажут.",
        "level1": "Приношу свои идеи руководителю, стараюсь что-то делать сам.",
        "level2": "Могу придумать новые задачи/идеи, которые помогут проекту.",
        "level3": "Могу придумать новые задачи/идеи, сделать их MVP и оценить пользу для бизнеса."
    },
    "base_business_analysis": {
        "name": "Основы бизнес-анализа",
        "level0": "Понимаю ключевые принципы, знаю роль бизнес-аналитика, основные задачи.",
        "level1": "Знаю основные методологии и стандарты, знаком с BABOK, BPMN, UML, Lean, Six Sigma.",
        "level2": "Умею анализировать и оптимизировать бизнес-процессы, выявляю узкие места, проектирую 'как есть' и 'как должно быть'.",
        "level3": "Разрабатываю стратегию изменений, внедряю улучшения, обосновываю эффективность изменений."
    },
    "business_process_modeling": {
        "name": "Моделирование бизнес-процессов",
        "level0": "Создаю базовые схемы процессов, умею строить блок-схемы.",
        "level1": "Работаю с инструментами моделирования.",
        "level2": "Проектирую сложные процессы, моделирую интеграционные схемы, описываю системы взаимодействия.",
        "level3": "Создаю архитектуру процессов компании, проектирую сквозные процессы, управляю трансформацией бизнес-модели."
    },
    "optimization_business_processes": {
        "name": "Оптимизация и автоматизация бизнес-процессов",
        "level0": "Знаю основы оптимизации, знаком с принципами бережливого производства.",
        "level1": "Использую методы анализа и улучшения, выявляю узкие места, анализирую метрики процессов.",
        "level2": "Разрабатываю и внедряю улучшения, создаю стратегии цифровой трансформации, подбираю решения для автоматизации.",
        "level3": "Проектирую архитектуру изменений, разрабатываю концепции улучшения процессов на уровне всей компании."
    },
    "collecting_requirements": {
        "name": "Методы сбора требований",
        "level0": "Знаком с методами сбора информации, провожу интервью, анализ документов, анкетирование.",
        "level1": "Применяю продвинутые методы, работаю с фокус-группами, воркшопами, мозговыми штурмами.",
        "level2": "Формирую структурированные требования.",
        "level3": "Разрабатываю систему управления требованиями, создаю фреймворки для сбора, анализа и обновления требований."
    },
    "formalization_requirements": {
        "name": "Документирование и формализация требований",
        "level0": "Пишу простые технические задания, фиксирую требования в текстовом формате.",
        "level1": "Описываю требования в структурированном виде, использую UML.",
        "level2": "Работаю с методологиями управления требованиями.",
        "level3": "Настраиваю процессы управления требованиями."
    },
    "prioritization": {
        "name": "Приоритизация и управление изменениями",
        "level0": "Использую базовые методы приоритизации.",
        "level1": "Работаю с бэклогом, формирую roadmap, оцениваю влияние изменений.",
        "level2": "Организую управление изменениями, анализирую вклад изменений.",
        "level3": "Формирую стратегию управления изменениями, разрабатываю процессы для крупных проектов."
    },
    "data_interpretation": {
        "name": "Основы работы с данными и интерпретация данных",
        "level0": "Работаю с базовыми инструментами анализа, Excel, Google Sheets, сводные таблицы.",
        "level1": "Использую SQL, пишу простые запросы.",
        "level2": "Применяю BI-инструменты, Power BI, Tableau.",
        "level3": "Строю комплексные аналитические модели, работаю с Big Data, применяю машинное обучение."
    },
    "data_analysis": {
        "name": "Методы анализа данных",
        "level0": "Знаю основы статистики, медиана, мода, стандартное отклонение.",
        "level1": "Анализирую сегменты пользователей, выявляю тренды.",
        "level2": "Использую предиктивную аналитику.",
        "level3": "Проектирую архитектуру аналитики."
    },
    "base_project_management": {
        "name": "Основы управления проектами",
        "level0": "Понимаю базовые методологии, Waterfall, Agile, Scrum.",
        "level1": "Работаю с инструментами управления задачами.",
        "level2": "Организую процессы разработки, веду спринты, управляю сроками и ресурсами.",
        "level3": "Разрабатываю стратегию управления проектами."
    },
    "product_management": {
        "name": "Управление продуктами",
        "level0": "Знаком с основами Product Management, понимаю роль продукта, жизненный цикл.",
        "level1": "Формирую бэклог и roadmap, оцениваю потребности бизнеса, приоритизирую задачи.",
        "level2": "Работаю с метриками продукта.",
        "level3": "Разрабатываю стратегию продукта, управляю всей жизненной стратегией продукта."
    }
}
